Data Cleaning and Preparation

In [19]:
#libraries

import pandas as pd
import numpy as np
from numpy import nan as NA
from array import array
from numpy import int64
from numpy import int8
import re

In [20]:
In [10]: string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [11]: string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [21]:
In [13]: string_data[0] = None

In [14]: string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
In [16]: data = pd.Series([1, NA, 3.5, NA, 7])

In [17]: data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
In [19]: data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
   ....:                      [NA, NA, NA], [NA, 6.5, 3.]])

In [20]: cleaned = data.dropna()

In [21]: print(data)
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [24]:
In [23]: data.dropna(how='all') # drop those which are all na, if there is some value in some column, don't drop

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
In [24]: data[4] = NA

In [25]: data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
In [26]: data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
In [27]: df = pd.DataFrame(np.random.randn(7, 3))

In [28]: df.iloc[:4, 1] = NA

In [29]: df.iloc[:2, 2] = NA

In [30]: df

          0         1         2
0  0.467775       NaN       NaN
1  1.708692       NaN       NaN
2 -1.119376       NaN -1.990208
3  0.272769       NaN  1.288442
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [28]:
In [31]: df.dropna()

          0         1         2
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [29]:
In [32]: df.dropna(thresh=2)

          0         1         2
2 -1.119376       NaN -1.990208
3  0.272769       NaN  1.288442
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [30]:
In [33]: df.fillna(0)

          0         1         2
0  0.467775  0.000000  0.000000
1  1.708692  0.000000  0.000000
2 -1.119376  0.000000 -1.990208
3  0.272769  0.000000  1.288442
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [31]:
In [34]: df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.467775  0.500000  0.000000
1  1.708692  0.500000  0.000000
2 -1.119376  0.500000 -1.990208
3  0.272769  0.500000  1.288442
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [32]:
In [35]: _ = df.fillna(0, inplace=True)

In [36]: df

          0         1         2
0  0.467775  0.000000  0.000000
1  1.708692  0.000000  0.000000
2 -1.119376  0.000000 -1.990208
3  0.272769  0.000000  1.288442
4  0.081410  0.401276  0.649680
5 -0.120094 -0.749074 -0.907744
6 -1.252223  0.378240  2.483321

In [33]:
In [37]: df = pd.DataFrame(np.random.randn(6, 3))

In [38]: df.iloc[2:, 1] = NA

In [39]: df.iloc[4:, 2] = NA

In [40]: df

          0         1         2
0  0.123104  1.038005 -0.684072
1  0.856854  0.041669  1.476766
2 -0.538190       NaN  0.825491
3  1.002078       NaN  0.900174
4 -2.290849       NaN       NaN
5 -2.132830       NaN       NaN

In [34]:
In [41]: df.fillna(method='ffill')

          0         1         2
0  0.123104  1.038005 -0.684072
1  0.856854  0.041669  1.476766
2 -0.538190  0.041669  0.825491
3  1.002078  0.041669  0.900174
4 -2.290849  0.041669  0.900174
5 -2.132830  0.041669  0.900174

In [35]:
In [42]: df.fillna(method='ffill', limit=2)

          0         1         2
0  0.123104  1.038005 -0.684072
1  0.856854  0.041669  1.476766
2 -0.538190  0.041669  0.825491
3  1.002078  0.041669  0.900174
4 -2.290849       NaN  0.900174
5 -2.132830       NaN  0.900174

In [36]:
In [43]: data = pd.Series([1., NA, 3.5, NA, 7])

In [44]: data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
In [45]: data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
   ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [46]: data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
 data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
In [48]: data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
In [49]: data['v1'] = range(7)

In [50]: data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
In [51]: data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
In [52]: data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   ....:                               'Pastrami', 'corned beef', 'Bacon',
   ....:                               'pastrami', 'honey ham', 'nova lox'],
   ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
In [55]: lowercased = data['food'].str.lower()

In [56]: lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
In [57]: data['animal'] = lowercased.map(meat_to_animal)

In [58]: data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
In [59]: data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
In [60]: data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [61]: data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
In [63]: data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [47]:
In [64]: data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [48]:
In [65]: data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
In [66]: data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])
In [67]: transform = lambda x: x[:4].upper()

In [50]:
In [69]: data.index = data.index.map(transform)

In [70]: data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
In [71]: data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [52]:
In [72]: data.rename(index={'OHIO': 'INDIANA'},
   ....:             columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [53]:
In [73]: data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [74]: data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [54]:
In [75]: ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
    
In [76]: bins = [18, 25, 35, 60, 100]

In [77]: cats = pd.cut(ages, bins)

In [78]: cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [55]:
In [79]: cats.codes
Out[79]: array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [80]: cats.categories

TypeError: array.array() takes no keyword arguments

In [ ]:
In [82]: pd.cut(ages, [18, 26, 36, 61, 100], right=False)

In [ ]:
In [83]: group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [84]: pd.cut(ages, bins, labels=group_names)

In [ ]:
In [85]: data = np.random.rand(20)

In [86]: pd.cut(data, 4, precision=2)

In [ ]:
In [87]: data = np.random.randn(1000)  # Normally distributed

In [88]: cats = pd.qcut(data, 4)  # Cut into quartiles

In [89]: cats

In [ ]:
In [90]: pd.value_counts(cats)

In [ ]:
In [91]: pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [ ]:
In [92]: data = pd.DataFrame(np.random.randn(1000, 4))

In [93]: data.describe()

In [56]:
In [94]: col = data[2]

In [95]: col[np.abs(col) > 3]

KeyError: 2

In [ ]:
In [96]: data[(np.abs(data) > 3).any(1)]

In [57]:
In [97]: data[np.abs(data) > 3] = np.sign(data) * 3

In [98]: data.describe()

            one       two     three  four
count  3.000000  3.000000  3.000000   3.0
mean   2.000000  2.333333  2.666667   3.0
std    1.732051  1.154701  0.577350   0.0
min    0.000000  1.000000  2.000000   3.0
25%    1.500000  2.000000  2.500000   3.0
50%    3.000000  3.000000  3.000000   3.0
75%    3.000000  3.000000  3.000000   3.0
max    3.000000  3.000000  3.000000   3.0

In [58]:
In [99]: np.sign(data).head()

         one  two  three  four
INDIANA    0    1      1     1
COLO       1    1      1     1
NEW        1    1      1     1

In [59]:
In [100]: df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [101]: sampler = np.random.permutation(5)

In [102]: print(sampler)
df

[4 0 1 3 2]

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [60]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [61]:
In [105]: df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7

In [62]:
In [106]: choices = pd.Series([5, 7, -1, 6, 4])

In [107]: draws = choices.sample(n=10, replace=True)

In [108]: draws

3    6
3    6
1    7
2   -1
2   -1
0    5
1    7
0    5
0    5
3    6
dtype: int64

In [63]:
In [109]: df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
   .....:                    'data1': range(6)})

In [110]: pd.get_dummies(df['key']) # this is converting to indicator matrix.

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [64]:
dommies = pd.get_dummies(df['key'], prefix='key')
df_with_dommies = df[['data1']].join(dommies)
df_with_dommies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

This is a sample application which catagories the movies by it's geners.

In [65]:
In [114]: mnames = ['movie_id', 'title', 'genres']

In [115]: movies = pd.read_table('/Users/praladneupane/Documents/python/0636920023784/data/datasets/movielens/movies.dat', sep='::',
   .....:                        header=None, names=mnames)

In [116]: movies[:10]

/Users/praladneupane/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [66]:
all_geners = []

for x in movies.genres:
    all_geners.extend(x.split('|'))

genres = pd.unique(all_geners)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [67]:
zero_matrix = np.zeros((len(movies), len(geners)))

dommies = pd.DataFrame(zero_matrix, columns=genres)
dommies

NameError: name 'geners' is not defined

In [68]:
In [123]: gen = movies.genres[0]

In [124]: gen.split('|')

['Animation', "Children's", 'Comedy']

In [69]:
In [125]: dummies.columns.get_indexer(gen.split('|'))

NameError: name 'dummies' is not defined

In [ ]:
for i , gen in enumerate(movies.genres):
    indices =dommies.columns.get_indexer(gen.split('|'))
    dommies.iloc[i, indices] = 1
    
movies_windic = movies.join(dommies.add_prefix('Genre_'))
movies_windic.iloc[0]

In [ ]:
In [129]: np.random.seed(12345)

In [130]: values = np.random.rand(10)

In [132]: bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [133]: pd.get_dummies(pd.cut(values, bins))

    String Manipulationn

In [70]:
In [136]: pieces = [x.strip() for x in val.split(',')]

In [137]: pieces

NameError: name 'val' is not defined

In [ ]:
In [138]: first, second, third = pieces

In [139]: first + '::' + second + '::' + third

In [ ]:
In [138]: first, second, third = pieces

In [139]: first + '::' + second + '::' + third

In [ ]:
In [140]: '::'.join(pieces)

    Regular Expression

In [71]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' # regex pattern to detect email address.

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [72]:
In [155]: regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [73]:
In [156]: m = regex.search(text)


In [158]: text[m.start():m.end()]
    
print(regex.match(text))

None

In [74]:
 print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [75]:
In [161]: pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [162]: regex = re.compile(pattern, flags=re.IGNORECASE)

In [76]:
In [163]: m = regex.match('wesm@bright.net')

In [164]: m.groups()

('wesm', 'bright', 'net')

In [77]:
In [165]: regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [78]:
In [166]: print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [79]:
In [167]: data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
   .....:         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [168]: data = pd.Series(data)

In [169]: data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [80]:
In [173]: data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [81]:
In [174]: matches = data.str.match(pattern, flags=re.IGNORECASE)

In [175]: matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [82]:
In [178]: data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object